In [1]:
import pandas as pd

In [2]:
# Provide the correct path to your CSV file
file_path = r'C:\Users\Ernie Munar\Desktop\THESIS WRITING\SYNTHETIC DATASET_3000_null.csv'  # Using 'r' before the string to interpret it as a raw string

# Read the CSV file into a DataFrame
df = pd.read_csv(file_path)

In [3]:
df.head()

   Faculty  1st Semester  2nd Semester  Average Classification    Value
0        1           4.0           1.5     2.75  Non-Performer        2
1        2           3.0           4.1     3.55      Performer        1
2        3           2.2           4.8      3.5      Performer        1
3        4           2.0           NaN  #VALUE!        #VALUE!  #VALUE!
4        5           3.3           2.8     3.05      Performer        1

In [4]:
df.describe()

           Faculty  1st Semester  2nd Semester
count  3000.000000   3000.000000   2995.000000
mean   1500.500000      2.981100      2.980467
std     866.169729      1.079655      1.096488
min       1.000000      1.100000      1.100000
25%     750.750000      2.000000      2.000000
50%    1500.500000      3.000000      3.000000
75%    2250.250000      3.900000      3.900000
max    3000.000000      4.900000      4.900000